from app.translations.schema import MovieTranslation

# hindi
translations = {
    "Nausicaä of the Valley of the Wind" : MovieTranslation(
         title = "राजकुमारी नौसिका की जंग",
        description = "सुदूर भविष्य में, एक भयावह युद्ध के एक हजार वर्ष बाद, पृथ्वी जहरीले मशरूमों और विशालकाय कीड़ों से ग्रस्त जंगलों से ढकी हुई दिखाई देती है। पुरुषों का नाश कर दिया गया है; बचे हुए लोग कुछ अलग-थलग गांवों में रहते हैं और विषैली गैसों और विशाल उत्परिवर्ती कीटों से दूषित जंगल के पास मुश्किल से जीवित रहते हैं, जो पृथ्वी के अधिकांश भाग में फैले हुए हैं। नौसिका पवन घाटी की राजकुमारी है, जो एक छोटा सा राज्य है जो अधिक शक्तिशाली और शत्रुतापूर्ण राज्यों से घिरा हुआ है। वह एक योद्धा है जो जहाज चलाना जानती है, लेकिन वह दयालु भी है, इतनी दयालु कि वह कीड़ों को दुश्मन नहीं मानती, विशेष रूप से ओम, विशालकाय और डरावने आर्थ्रोपोड, जिनके प्रति वह एक अजीब सहानुभूति महसूस करती है। संकट तब उत्पन्न होता है जब राजकुमारी कुषाण के नेतृत्व में पड़ोसी राज्य टोलमेकिआ, पवन घाटी पर आक्रमण करता है।"
    ),
    "Castle in the Sky" : MovieTranslation(
         title = "हावई किला",
        description = "पूर्णिमा की रात को बादलों के समुद्र के ऊपर एक विमान उड़ता हुआ। मुस्का, एक गुप्त सरकारी एजेंट, शीता नाम की एक लड़की के साथ टेडिस के किले तक जाता है। अचानक जहाज पर समुद्री डाकुओं द्वारा हमला कर दिया जाता है, जो सरकार की तरह, उस जादुई पत्थर का रहस्य जानना चाहते हैं जिसे शीता अपने गले में पहनती है। यह पत्थर वह कुंजी है जो सेलेस्टियल फोर्ट्रेस के दरवाजे खोलेगी, जो आकाश के मध्य में एक तैरता हुआ द्वीप है, जिसका निर्माण एक रहस्यमयी जाति ने किया था जो बहुत समय पहले ग्रह से गायब हो गई थी। पाज़ू नामक एक युवा लड़का, शीता से मित्रता करता है, उसे उसके अनुयायियों से बच निकलने में मदद करता है, और साथ मिलकर वे आकाश किले के रहस्य को सुलझाने निकल पड़ते हैं। जब शीता और पाज़ू आकाश किले की ओर अपनी यात्रा शुरू करते हैं, तो वे घटनाओं की एक अपरिवर्तनीय श्रृंखला शुरू कर देते हैं। इस रहस्यमयी जगह पर उन्हें ऐसा खजाना मिलेगा जो दुनिया पर राज करने की शक्ति से भी कहीं बड़ा है।"
    ),
    "Grave of Fireflies" : MovieTranslation(
         title = "ग्रेव ऑफ द फायरफ्लाइस",
         description = "द्वितीय विश्व युद्ध (1939-1945)। सेइता और सेत्सुको कोबे में रहने वाले एक जापानी नौसेना अधिकारी के बच्चे हैं। एक दिन, बमबारी के दौरान, वे समय पर बंकर तक पहुंचने में सफल नहीं हो पाते, जहां उनकी मां उनका इंतजार कर रही होती है। बाद में जब वे अपनी मां को ढूंढते हैं तो पाते हैं कि वह स्कूल में गंभीर रूप से घायल अवस्था में पड़ी है, जिसे आपातकालीन अस्पताल में तब्दील कर दिया गया है।"
    ),
    "My Neighbor Totoro" : MovieTranslation(
         title = "जादुई दोस्त तोतोरो",
         description = "1950 के दशक में एक जापानी परिवार ग्रामीण क्षेत्र में चला जाता है। दो बेटियाँ, सत्सुकी और मेई, टोटोरो नामक एक वन आत्मा से मित्रता करती हैं। पिता एक विश्वविद्यालय के प्रोफेसर हैं जो अपनी बेटियों को भूत-प्रेतों और आत्माओं के बारे में दंतकथाएं और जादुई कहानियां सुनाकर उनकी कल्पना को उत्तेजित करते हैं, जो घरों की रक्षा करते हैं, जबकि मां अस्पताल में बीमार है।"
    ),
    "Kiki's Delivery Service" : MovieTranslation(
         title = "किकि की डिलीवरी सार्विस",
         description = "किकी (या स्पेनिश डब में निकी) एक 13 साल की युवा चुड़ैल है, जो प्रशिक्षण ले रही है, और जो एक बुद्धिमान काली बिल्ली जिजी के साथ झाड़ू पर उड़ने का आनंद लेती है। परंपरा के अनुसार, उस उम्र की सभी चुड़ैलों को एक वर्ष के लिए अपना घर छोड़ना पड़ता है ताकि वे स्वयं की देखभाल करना सीख सकें। इस प्रकार, वह जान सकेगी कि जिम्मेदारी, स्वतंत्रता और मित्रता का क्या अर्थ है। रास्ते में, किकी (निकी) और जीजी को एक नया दोस्त, टॉम्बो मिलेगा, जिसके साथ वे असाधारण रोमांच का अनुभव करेंगे।"
    ),
    "Only Yesterday" : MovieTranslation(
         title = "केवल कल",
         description = "ताएको ओकाजिमा एक युवा महिला है जो छुट्टी मांगती है ताकि वह अपने घर यामागाटा, अपनी भाभी के गांव, जहां उसने अपने जीवन के सबसे सुखद क्षण बिताए थे, लौट सके। अपने रिश्तेदारों के खेत की यात्रा और उसके बाद वहां रहने के दौरान, ताएको अपने अतीत को याद करेगी, जबकि वह वर्तमान में तीव्रता से जी रही होगी, बिना यह जाने कि उसे अपने जीवन में क्या करना है।"
    ),
    "Porco Rosso" : MovieTranslation(
         title = "पोर्को रोसो",
         description = "अंतरयुद्ध काल. पोर्को एक उड़ने वाला सुअर है जो एड्रियाटिक के हवाई डाकुओं द्वारा की जाने वाली सभी समुद्री डकैती की गतिविधियों को विफल करता है। बहादुर और कुशल विमान चालक को ख़त्म करने के लिए वे एक अमेरिकी साहसी को काम पर रखने पर सहमत हो जाते हैं जिसका मिशन उसे ख़त्म करना होगा।"
    ),
    "Ocean Waves" : MovieTranslation(
         title = "महासागर की लहरें",
         description = "टोक्यो की एक लड़की को अभी-अभी कोच्चि शहर के एक हाई स्कूल में स्थानांतरित किया गया है। वह सुंदर है, खेलकूद और पढ़ाई में अच्छी है, लेकिन किसी कारणवश वह स्कूल के सामाजिक जीवन में फिट नहीं बैठ पाती। ताकू मोरिसाकी और युकाटा मात्सुनो, दो अच्छे दोस्त भी उसी स्कूल में पढ़ते हैं। ताकू मोरिसाकी नए छात्र मुतो में स्पष्ट रूप से दिलचस्पी दिखाने लगता है।"
    ),
    "Pom Poko" : MovieTranslation(
         title = "पोम पोको",
         description = "एक शहर के निकट स्थित हरे-भरे जंगल के आसन्न विनाश को देखते हुए, जिसके नेता उसके स्थान पर एक आवासीय विकास परियोजना बनाना चाहते हैं, जंगल में रहने वाले रैकून अपने घरों को बचाने के लिए इस अभियान को विफल करने का प्रयास करेंगे।"
    ),
    "Whisper of the Heart" : MovieTranslation(
         title = "दिल की कानाफूसी",
         description = "एक युवा पुस्तक प्रेमी छात्रा को पता चलता है कि पुस्तकालय से उसने जो भी पुस्तकें चुनी हैं, वे पहले एक ही व्यक्ति द्वारा चुनी गई थीं। जब उसे पता चलता है कि वह कौन है, तो उसकी मुलाकात सेजी नामक एक युवक से होती है, जो वायलिन बनाने की कला सीख रहा है।"
    ),
    "Princess Mononoke" : MovieTranslation(
         title = "राजकुमारी मोनोनोके",
         description = "पागल सूअर द्वारा दिए गए घाव को ठीक करने के लिए, युवा अशिताका मृग देवता की खोज में जाता है, क्योंकि केवल वही उसे जादू से मुक्त कर सकते हैं। अपनी यात्रा के दौरान वह यह पता लगाता है कि किस प्रकार जंगल के जानवर उन मनुष्यों से लड़ते हैं जो प्रकृति को नष्ट करने पर तुले हैं।"
    ),
    "My Neighbors the Yamadas" : MovieTranslation(
         title = "मेरे पड़ोसी यमदास",
         description = "हिसाची इशी के प्रसिद्ध मंगा पर आधारित यह फिल्म टोक्यो के एक ठेठ मध्यवर्गीय परिवार के दैनिक जीवन की छोटी, कल्पनाशील कहानियां बताती है। यमादा परिवार में ताकाशी और मात्सुको (पिता और माता), शिगे (सास), नोबोरू (पुत्र), नोनोको (पुत्री) और पोची (परिवार का कुत्ता) शामिल हैं।"
    ),
    "Spirited Away" : MovieTranslation(
         title = "स्पिरिटेड अवे",
         description = "चिहिरो दस साल की लड़की है जो अपने माता-पिता के साथ कार से यात्रा करती है। एक सुरंग से गुजरने के बाद वे एक काल्पनिक दुनिया में पहुंचते हैं, जिसमें मनुष्यों के लिए कोई जगह नहीं है, केवल प्रथम और द्वितीय श्रेणी के देवताओं के लिए जगह है। जब चिहिरो को पता चलता है कि उसके माता-पिता को सूअर में बदल दिया गया है, तो वह बहुत अकेली और डरी हुई महसूस करती है।"
    ),
    "The Cat Returns" : MovieTranslation(
         title = "द कैट रिटर्न",
         description = "यह कहानी है हारू नामक एक युवा लड़की की, जिसका भाग्य तब बदल जाता है जब एक दिन हाई स्कूल से लौटते समय वह एक बिल्ली को ट्रक के नीचे आने से बचाती है। लेकिन यह कोई साधारण बिल्ली नहीं है, यह ल्यून है, बिल्ली साम्राज्य का राजकुमार। अपने कार्य के पुरस्कार के रूप में, हारु को ल्यून राज्य में कुछ समय बिताने के लिए आमंत्रित किया जाता है।"
    ),
    "Howl's Moving Castle" : MovieTranslation(
         title = "हाउल का चलता-फिरता महल",
         description = "यह सोफी नामक एक युवा महिला की कहानी है, जो एक भयानक अभिशाप से ग्रस्त है, जिसके कारण वह एक बूढ़ी महिला का रूप ले लेती है। सोफी जादूगर हाउल से मदद मांगने का फैसला करती है, जो एक चलते-फिरते महल में रहता है, लेकिन शायद हाउल को ही सोफी की मदद की जरूरत है।"
    ),
    "Tales from Earthsea" : MovieTranslation(
         title = "पृथ्वी से दास्तां",
         description = "स्टूडियो घिबली एनीमे फिल्म का निर्देशन हायाओ मियाज़ाकी के पुत्र गोरो मियाज़ाकी ने किया है। यह उर्सुला के. ले गिनी द्वारा लिखित श्रृंखला की तीसरी पुस्तक \"अर्थसी: द फारथेस्ट शोर\" पर आधारित है। जापान में इसका एक मंगा रूपांतरण प्रकाशित किया गया है। कहानी टेरामार द्वीपसमूह में घटती है, जहाँ ड्रेगन, जादूगर, भूत, ताबीज और शक्तियां हैं। यह एक ऐसी दुनिया है जो जादू से और सबसे बढ़कर शब्दों से शासित होती है, क्योंकि प्रत्येक वस्तु का अपना वास्तविक नाम होता है, जो सृष्टि के दौरान निर्दिष्ट किया गया था, जो जादूगरों को तत्वों और जानवरों पर प्रभुत्व प्रदान करता है। इसके लोग सरल और शांत हैं, उनका एकमात्र लक्ष्य शांति और ज्ञान प्राप्त करना है..."
    ),
    "Ponyo": MovieTranslation(
         title = "पोन्यो",
         description = "कहानी 5 साल के लड़के सोसुके और एक मछली राजकुमारी के साथ उसके रिश्ते पर केंद्रित है, जो इंसान बनने की लालसा रखती है। \"द लिटिल मरमेड\" का निःशुल्क रूपांतरण जिसे 2008 के वेनिस फिल्म महोत्सव में आलोचकों द्वारा बहुत अच्छी प्रतिक्रिया मिली थी।"
    ),
    "The Secret World of Arrietty": MovieTranslation(
         title = "नन्हीं दुनिया की एरिएटी",
         description = "एक देहाती हवेली के फर्श के नीचे छिपे एक छोटे से घर में, बमुश्किल 10 सेमी लंबे छोटे जीवों का एक परिवार रहता है। लंबे, जिनका नियम है कि वे कभी भी मनुष्यों को खुद को नहीं दिखाते हैं; हालांकि, उनका शांत जीवन तब बदल जाता है जब एरिएटी नामक एक साहसी किशोरी को गलती से एक लड़के ने देख लिया, जो अपनी नाजुक सेहत के कारण हाल ही में घर में रहने आया है। जैसे-जैसे दोनों के बीच गहरी दोस्ती विकसित होती है, छोटे प्राणियों का अस्तित्व खतरनाक रूप से खतरे में पड़ जाएगा... मैरी नॉर्टन द्वारा लिखित और समकालीन टोक्यो में सेट बच्चों की कहानी \"द बॉरोअर्स\" का रूपांतरण।"
    ),
    "From Up on Poppy Hill" : MovieTranslation(
         title = "ऊपर से पोपी हिल",
         description = "जापान, 1963. उमी मात्सुज़ाकी एक हाई स्कूल की छात्रा है, जो अपनी माँ की अनुपस्थिति में अपने दो भाइयों और दादी की देखभाल करती है, साथ ही समुद्र के पास एक पहाड़ी पर स्थित पश्चिमी शैली की सराय, कोक्लीकोट मैनर का प्रबंधन भी करती है। लड़की अपनी जिम्मेदारियों को स्कूली जीवन के साथ आसानी से मिला लेती है। एक दिन उसकी मुलाकात पत्रकारिता क्लब के सदस्य शुन काज़ामा और विद्यार्थी परिषद के अध्यक्ष शिरो मिज़ुनुमा से होती है। दोनों क्वार्टियर लैटिन के प्रतिनिधि हैं, जो एक पुरानी इमारत है जिसमें विभिन्न छात्र संघों का मुख्यालय है और जिसके ध्वस्त होने का खतरा है। उमी और काज़ामा के बीच गहरी दोस्ती पैदा होगी, जो अतीत के एक रहस्य की अप्रत्याशित खोज से जटिल हो सकती है। साथ मिलकर वे अंधकारमय अतीत, कठिन वर्तमान और आशापूर्ण भविष्य के बीच एक साथ रहने का रास्ता खोजेंगे, वह भी ऐसे समय में जब जापान उबरने लगा है।"
    ),
    "The Wind rises" : MovieTranslation(
         title = "हवा उठती है",
         description = "जीरो होरिकोशी, जो उड़ान भरने और सुंदर हवाई जहाज डिजाइन करने का सपना देखते हैं, प्रसिद्ध इतालवी एयरोनॉटिकल डिजाइनर कैप्रोनी से प्रेरित हैं। बचपन से ही अदूरदर्शी होने के कारण उड़ान भरने में असमर्थ होने के कारण वे 1927 में एक इंजीनियरिंग कंपनी के वैमानिकी प्रभाग में शामिल हो गए। उनकी प्रतिभा को जल्द ही पहचान लिया गया और वे सबसे प्रतिष्ठित वैमानिकी डिजाइनरों में से एक बन गए। यह जीवनी पर आधारित फिल्म उनके जीवन से जुड़ी ऐतिहासिक घटनाओं को पुनः प्रस्तुत करती है, जैसे 1923 का कांटो भूकंप, महामंदी, तपेदिक महामारी और जापान का द्वितीय विश्व युद्ध में प्रवेश।"
    ),
    "The Tale of Princess Kaguya" : MovieTranslation(
         title = "राजकुमारी कगुया की कहानी",
         description = "यह 9वीं शताब्दी की अज्ञात जापानी लोक कथा \"बांस काटने वाला\" पर आधारित है। कहानी तब शुरू होती है जब एक बुजुर्ग किसान दम्पति को बांस के पौधे के अंदर एक छोटी बच्ची मिलती है और वे उसे अपनी बेटी के रूप में गोद लेने का निर्णय लेते हैं। वर्ष बीतते हैं और वह जल्द ही एक खूबसूरत महिला बन जाती है, जिसकी चाहत कई शक्तिशाली पुरुषों को होती है।"
    ),
    "When Marnie Was There" : MovieTranslation(
         title = "मार्नी और मैं",
         description = "अन्ना एक अकेली लड़की है, जिसके कोई दोस्त नहीं हैं, वह अपने दत्तक माता-पिता के साथ रहती है। एक दिन उसे मिस्टर और मिसेज पेग के पास भेजा जाता है। वहां, जहां रेत के टीले फैले हैं, उसकी मुलाकात मार्नी नाम की एक लड़की से होती है, जो जल्द ही उसकी सबसे अच्छी दोस्त बन जाती है। दोस्ती के बारे में बहुत सी बातें जानने के बाद, अन्ना को एहसास होगा कि मार्नी वह नहीं है जो वह दिखती है..."
    ),
    "Earwig and the Witch" : MovieTranslation(
         title = "Earwig and the Witch",
         description = "सभी अनाथ बच्चों को सेंट मोरवाल्ड अनाथालय में रहना पसंद नहीं है, लेकिन इयरविग को यह पसंद है। केंद्र के दरवाजे उसके लिए खुलने के पहले दिन से ही उसके पास एक खुश लड़की बनने के लिए आवश्यक सभी चीजें मौजूद हैं। हालाँकि, सब कुछ उस दिन बदल जाता है जब बेला यागा और मैन्ड्रेक पालक माता-पिता के रूप में प्रच्छन्न होकर सेंट मोरवाल्ड जाते हैं। इयरविग अपने घर में चली जाती है, जो एक विशाल घर है जो अदृश्य कमरों, औषधियों और मंत्र पुस्तकों से भरा है, और हर कोने में जादू है। यद्यपि कई बच्चे बिना सोचे-समझे भाग जाते, लेकिन इयरविग ने जांच करने का निर्णय लिया। अपनी बुद्धि का प्रयोग करते हुए (और एक बात करने वाली बिल्ली की थोड़ी सी मदद से), वह सबको यह दिखाने का प्रयास करती है कि घर में बॉस कौन है।\n\nडायना विने जोन्स के इसी नाम के उपन्यास से रूपांतरित। यह स्टूडियो घिबली की पहली कंप्यूटर एनिमेटेड फीचर फिल्म है, जिसका निर्देशन गोरो मियाज़ाकी ने किया है, जिसका लेखन और निर्देशन हयाओ मियाज़ाकी ने किया है, तथा इसका निर्माण तोशियो सुजुकी ने किया है।"
    ),
    "The Boy and the Heron" : MovieTranslation(
         title = "How do you live?",
         description = "12 वर्षीय महितो अपनी मां की मृत्यु के बाद नए शहर में बसने के लिए संघर्ष करता है। हालाँकि, जब एक बोलने वाला बगुला महितो को बताता है कि उसकी माँ अभी भी जीवित है, तो वह उसकी तलाश में एक परित्यक्त टॉवर में प्रवेश करता है, जो उसे दूसरी दुनिया में ले जाता है। फिल्म का शीर्षक 1937 के उपन्यास 'किमितची वा दो इकिरु का' पर आधारित है, जिसे योशिनो जेनज़ाबुरो ने लिखा था, लेकिन फिल्म में उपन्यास से असंबंधित एक मूल कहानी है।"
    ),
    "The Red Turtle": MovieTranslation(
         title = "द रेड टर्टल",
         description = "यह मूक कहानी एक निर्जन उष्णकटिबंधीय द्वीप पर रहने वाले एक व्यक्ति के बारे में है, जो कछुओं, केकड़ों और पक्षियों से भरा हुआ है। यह फिल्म मनुष्य के जीवन के मुख्य चरणों को बताती है। एनिमेटर माइकल डुडोक डी विट (अपनी लघु फिल्म \"फादर एंड डॉटर\" के लिए ऑस्कर विजेता) की फीचर फिल्म में पहली उपस्थिति। कई फ्रांसीसी प्रोडक्शन कंपनियों और स्टूडियो घिबली के बीच सह-निर्माण।"
    )
}
